{
    "Strawberry Lemonade": {
        "title": "Strawberry Lemonade",
        "ingredients": "['1 cup chopped fresh strawberries, stemmed & washed', '1/2 cup lemon juice', '1/4 cup agave or honey', '2 cups water', 'Ice for serving']",
        "instructions": "Pureé strawberries and honey in a blender or food processor until smooth and transfer to a pitcher. Pour the strawberry mixture, water and lemon juice in a pitcher and stir to combine. Chill and serve over ice.",
        "image_name": "strawberry-lemonade-51262830"
    },
    "Perfect Pork Chops": {
        "title": "Perfect Pork Chops",
        "ingredients": "['4 pork chops', 'Salt and freshly ground black pepper', 'N/A freshly ground black pepper', '3 tablespoons olive oil', '2 shallots, diced', '2 tablespoons butter', '2 cups white cooking wine', '3 tablespoons Dijon mustard', '1 tablespoon blackstrap molasses, maple syrup, or honey']",
        "instructions": "MAKE IT: Season both sides of the pork chops with salt and pepper to taste and drizzle with the olive oil. Set the chops, covered, on the counter for 1 hour before preparing the dish to bring them to room temperature. In a large skillet over medium heat, cook the shallots in butter until translucent. Add the wine, mustard, and molasses, syrup, or honey to the shallots and stir. Cook for 3 minutes, then add the pork chops and cover. Simmer for 25 minutes and remove from heat. To serve, let the pork chops rest for 5 minutes and then slice thinly and spoon the sauce over the top.",
        "image_name": "perfect-pork-chops-51206430"
    },
    "3-Ingredient Gingersnap Icebox Cake": {
        "title": "3-Ingredient Gingersnap Icebox Cake",
        "ingredients": "['2 cups heavy cream', '42 gingersnap cookies (about 10 ounces), divided', '3/4 cup orange marmalade, divided']",
        "instructions": "Using an electric mixer on medium-high speed, whip cream to stiff peaks in a large bowl. Arrange 10 cookies in a circle (8 around the edge and 2 in the middle) on a cake stand or large plate, breaking 1 center cookie to fit. Top with one-quarter of whipped cream, spreading gently almost to edge of cookies (you’ll want to see them peeking out). Dollop one-quarter of marmalade over. Repeat with 30 cookies and remaining cream and marmalade to make 4 layers, ending with marmalade. Place remaining 2 cookies in a resealable plastic bag. Using the back of a spoon, rolling pin, or meat mallet, crush to fine crumbs. Sprinkle crumbs over top layer, then chill at least 8 hours and up to 2 days.",
        "image_name": "3-ingredient-gingersnap-icebox-cake"
    },
    "Big Island Wild Pig with Cavatelli": {
        "title": "Big Island Wild Pig with Cavatelli",
        "ingredients": "['2 teaspoons fennel seeds', '1 tablespoon smoked paprika', '2 teaspoons (packed) golden brown sugar', '1 teaspoon dried crushed red pepper', '1 1/2 pounds boneless pork shoulder (Boston butt) or wild boar, excess fat trimmed', '1/4 cup vegetable oil', '3 cups low-salt chicken broth', '12 ounces cavatelli, campanelle, or tubular pasta (such as penne)', '2 tablespoons (1/4 stick) butter', '2 garlic cloves, peeled, pressed', '2 cups diced plum tomatoes (preferably organic; about 14 ounces)', '8 cups (packed) arugula (preferably organic; about 8 ounces)', '1 1/4 cups coarsely crumbled soft fresh goat cheese (about 6 ounces), divided', \"Ingredient info: Smoked paprika is sometimes labeled Pimentón dulce or Pimentón de la vera dulce. It's available at some supermarkets, at specialty foods stores, and from latienda.com. Wild boar is available from preferredmeats.com.\"]",
        "instructions": "Preheat oven to 375°. Enclose fennel seeds in resealable plastic bag; using mallet, coarsely crack seeds. (Alternatively, crack seeds in mortar with pestle.) Mix seeds, smoked paprika, brown sugar, crushed red pepper, 3/4 teaspoon salt, and 1/4 teaspoon black pepper in small bowl to blend. Place pork on sheet of foil. Sprinkle spice mixture all over pork and roll pork on foil sheet, pressing firmly so spices will adhere. Heat oil in heavy large ovenproof pot over medium-high heat. Add pork to pot and sear until brown on all sides, 8 to 9 minutes. Add 3 cups broth and any seasoning mixture remaining on sheet of foil; bring to boil. Cover pot tightly and transfer to oven. Braise until pork is very tender, turning pork every 30 minutes, about 2 hours total. Remove pot from oven. Uncover pot and cool pork in pot 1 hour. Transfer pork to cutting board. Cut pork into 1/2- to 3/4-inch cubes. Spoon off fat from top of sauce in pot. Return pork cubes to sauce in pot. DO AHEAD: Can be made 1 day ahead. Chill uncovered until cold, then cover and keep chilled. Rewarm pork and sauce over medium heat until heated through before using. Cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain pasta. Set aside. Melt butter in large skillet over medium-high heat. Add garlic to skillet; stir 30 seconds. Add tomatoes and arugula and toss until arugula wilts, 2 to 3 minutes. Add drained pasta to tomato mixture in skillet and toss 1 minute to blend. Add 1 cup crumbled goat cheese to skillet and toss just until cheese softens slightly but does not melt, about 1 minute. Season pasta to taste with salt and black pepper. Transfer pasta to large bowl. Spoon pork and sauce over. Scatter remaining 1/4 cup goat cheese over and serve.",
        "image_name": "big-island-wild-pig-with-cavatelli-363727"
    }
}