{
    "Irish Channel Corned Beef and Cabbage": {
        "title": "Irish Channel Corned Beef and Cabbage",
        "ingredients": "['3 pounds corned beef', '1 onion, chopped', '1 1/2 cups water', '1 14-oz. can chicken broth', '4 carrots, chopped', '1 head cabbage, broken apart']",
        "instructions": "Rinse the corned beef and cut off excess fat. Place the onion on the bottom of the slow cooker. Place the corned beef on top of the onion. Add water, chicken broth, carrots and cabbage. Cook on low heat for 8 to 10 hours, or until meat is cooked and vegetables are tender.",
        "image_name": "irish-channel-corned-beef-and-cabbage-51224220"
    },
    "Baked Penne with Green Chiles": {
        "title": "Baked Penne with Green Chiles",
        "ingredients": "['2 cups (480 ml) whole milk', '1 cup (240 ml) heavy cream', 'One 15-ounce (425-g) can crushed tomatoes', 'One 4-ounce (115-g) can diced green chiles, drained', '2 cups (230 g) shredded sharp Cheddar or Mexican blend cheese', '1 heaping tablespoon Dijon mustard', 'Salt and pepper', '1 pound (455 g) penne or ziti', '1 cup (100 g) freshly grated Pecorino or Parmesan cheese']",
        "instructions": "Preheat the oven to 500°F (260°C), with a rack in the middle position. Bring a large pot of water to a boil over high heat. Meanwhile, in a 13 by 9-inch (33 by 23-cm) baking dish, stir together the milk, cream, tomatoes, chiles, Cheddar, and mustard. Season with 1 teaspoon salt and some pepper, then set the tomato mixture aside. When the water boils, season it generously with salt; it should taste like seawater. When it returns to a boil, add the pasta, quickly stir to separate the noodles, then cover the pot. When the water returns to a boil again, uncover and boil the pasta until very al dente, stirring occasionally. Drain the pasta thoroughly, then pour the noodles on top of the tomato mixture and toss to combine. Gently “shake” the dish to distribute the ingredients, then top evenly with the Pecorino.* Bake until bubbling and lightly browned, about 12 minutes. Let rest for 5 to 10 minutes before serving. Prepare to * without preheating the oven, then keep, covered, in the refrigerator for up to 3 days or in the freezer for up to 1 month. Bake, covered, at 350°F (175°C) until hot, about 30 to 60 minutes (if frozen), uncovering for the last 10 minutes or so. Serve hot or warm. It will keep, loosely covered, in a 200°F (90°C) oven for up to 2 hours.",
        "image_name": "baked-penne-with-green-chiles"
    },
    "Ginger and Tamarind Refresher": {
        "title": "Ginger and Tamarind Refresher",
        "ingredients": "['2½ cups (600 ml) water', '2½ oz (70 g) sour tamarind pulp or paste', '8 oz (225 g) fresh ginger, preferably young', '1 cup (200 g) sugar', 'One 1 L bottle chilled club soda or 4 cups (960 ml) chilled water']",
        "instructions": "Bring 1½ cups (360 ml) of the water to a boil. Put the tamarind pulp in a heat-proof nonreactive bowl, and cover with the boiling water. Cover and let sit for about 1 hour, until the pulp has become soft and mushy. Using a small potato masher or clean hands, massage and squeeze the block to soften the pulp. Strain through a fine-mesh strainer suspended over a medium bowl, pressing the pulp through the strainer with a large spoon. Discard the seeds and other solids left behind. Refrigerate the tamarind extract in an airtight container in the refrigerator until ready to use, for up to 4 days. Rinse the ginger and gently scrub to remove any traces of dirt. If the ginger is young, with a thin skin, leave the skin on. Otherwise, peel. Cut into thin slices. In a medium saucepan, combine the ginger, sugar, and remaining 1 cup (240 ml) water. Bring to a boil over medium-high heat and immediately remove the saucepan from the heat. Cover and steep for 10 minutes. Strain the ginger simple syrup through a fine-mesh strainer and discard the ginger. In a large pitcher, mix the tamarind extract and the ginger simple syrup together. Fill eight tall glasses with ice. Pour 4 oz (120 ml) of the tamarind-ginger syrup into each glass, top with 4 oz (120 ml) of the club soda or chilled water, and stir. Store any remaining tamarind-ginger syrup in an airtight container in the refrigerator for up to 1 week. This rejuvenating drink combines the mild heat of young ginger and the sourness of tamarind. It’s wonderful during the warmer months. Young ginger requires no peeling before use because its outer skin is so thin. I recommend using South Asian tamarind, which is a lot more sour than the Mexican variety. Look for it in Asian and Indian markets.",
        "image_name": "ginger-and-tamarind-refresher-nik-sharma"
    },
    "Strawberry Lemonade": {
        "title": "Strawberry Lemonade",
        "ingredients": "['1 cup chopped fresh strawberries, stemmed & washed', '1/2 cup lemon juice', '1/4 cup agave or honey', '2 cups water', 'Ice for serving']",
        "instructions": "Pureé strawberries and honey in a blender or food processor until smooth and transfer to a pitcher. Pour the strawberry mixture, water and lemon juice in a pitcher and stir to combine. Chill and serve over ice.",
        "image_name": "strawberry-lemonade-51262830"
    }
}