{
    "Strawberry Lemonade": {
        "title": "Strawberry Lemonade",
        "ingredients": "['1 cup chopped fresh strawberries, stemmed & washed', '1/2 cup lemon juice', '1/4 cup agave or honey', '2 cups water', 'Ice for serving']",
        "instructions": "Pureé strawberries and honey in a blender or food processor until smooth and transfer to a pitcher. Pour the strawberry mixture, water and lemon juice in a pitcher and stir to combine. Chill and serve over ice.",
        "image_name": "strawberry-lemonade-51262830"
    },
    "Perfect Pork Chops": {
        "title": "Perfect Pork Chops",
        "ingredients": "['4 pork chops', 'Salt and freshly ground black pepper', 'N/A freshly ground black pepper', '3 tablespoons olive oil', '2 shallots, diced', '2 tablespoons butter', '2 cups white cooking wine', '3 tablespoons Dijon mustard', '1 tablespoon blackstrap molasses, maple syrup, or honey']",
        "instructions": "MAKE IT: Season both sides of the pork chops with salt and pepper to taste and drizzle with the olive oil. Set the chops, covered, on the counter for 1 hour before preparing the dish to bring them to room temperature. In a large skillet over medium heat, cook the shallots in butter until translucent. Add the wine, mustard, and molasses, syrup, or honey to the shallots and stir. Cook for 3 minutes, then add the pork chops and cover. Simmer for 25 minutes and remove from heat. To serve, let the pork chops rest for 5 minutes and then slice thinly and spoon the sauce over the top.",
        "image_name": "perfect-pork-chops-51206430"
    },
    "3-Ingredient Gingersnap Icebox Cake": {
        "title": "3-Ingredient Gingersnap Icebox Cake",
        "ingredients": "['2 cups heavy cream', '42 gingersnap cookies (about 10 ounces), divided', '3/4 cup orange marmalade, divided']",
        "instructions": "Using an electric mixer on medium-high speed, whip cream to stiff peaks in a large bowl. Arrange 10 cookies in a circle (8 around the edge and 2 in the middle) on a cake stand or large plate, breaking 1 center cookie to fit. Top with one-quarter of whipped cream, spreading gently almost to edge of cookies (you’ll want to see them peeking out). Dollop one-quarter of marmalade over. Repeat with 30 cookies and remaining cream and marmalade to make 4 layers, ending with marmalade. Place remaining 2 cookies in a resealable plastic bag. Using the back of a spoon, rolling pin, or meat mallet, crush to fine crumbs. Sprinkle crumbs over top layer, then chill at least 8 hours and up to 2 days.",
        "image_name": "3-ingredient-gingersnap-icebox-cake"
    },
    "Big Island Wild Pig with Cavatelli": {
        "title": "Big Island Wild Pig with Cavatelli",
        "ingredients": "['2 teaspoons fennel seeds', '1 tablespoon smoked paprika', '2 teaspoons (packed) golden brown sugar', '1 teaspoon dried crushed red pepper', '1 1/2 pounds boneless pork shoulder (Boston butt) or wild boar, excess fat trimmed', '1/4 cup vegetable oil', '3 cups low-salt chicken broth', '12 ounces cavatelli, campanelle, or tubular pasta (such as penne)', '2 tablespoons (1/4 stick) butter', '2 garlic cloves, peeled, pressed', '2 cups diced plum tomatoes (preferably organic; about 14 ounces)', '8 cups (packed) arugula (preferably organic; about 8 ounces)', '1 1/4 cups coarsely crumbled soft fresh goat cheese (about 6 ounces), divided', \"Ingredient info: Smoked paprika is sometimes labeled Pimentón dulce or Pimentón de la vera dulce. It's available at some supermarkets, at specialty foods stores, and from latienda.com. Wild boar is available from preferredmeats.com.\"]",
        "instructions": "Preheat oven to 375°. Enclose fennel seeds in resealable plastic bag; using mallet, coarsely crack seeds. (Alternatively, crack seeds in mortar with pestle.) Mix seeds, smoked paprika, brown sugar, crushed red pepper, 3/4 teaspoon salt, and 1/4 teaspoon black pepper in small bowl to blend. Place pork on sheet of foil. Sprinkle spice mixture all over pork and roll pork on foil sheet, pressing firmly so spices will adhere. Heat oil in heavy large ovenproof pot over medium-high heat. Add pork to pot and sear until brown on all sides, 8 to 9 minutes. Add 3 cups broth and any seasoning mixture remaining on sheet of foil; bring to boil. Cover pot tightly and transfer to oven. Braise until pork is very tender, turning pork every 30 minutes, about 2 hours total. Remove pot from oven. Uncover pot and cool pork in pot 1 hour. Transfer pork to cutting board. Cut pork into 1/2- to 3/4-inch cubes. Spoon off fat from top of sauce in pot. Return pork cubes to sauce in pot. DO AHEAD: Can be made 1 day ahead. Chill uncovered until cold, then cover and keep chilled. Rewarm pork and sauce over medium heat until heated through before using. Cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain pasta. Set aside. Melt butter in large skillet over medium-high heat. Add garlic to skillet; stir 30 seconds. Add tomatoes and arugula and toss until arugula wilts, 2 to 3 minutes. Add drained pasta to tomato mixture in skillet and toss 1 minute to blend. Add 1 cup crumbled goat cheese to skillet and toss just until cheese softens slightly but does not melt, about 1 minute. Season pasta to taste with salt and black pepper. Transfer pasta to large bowl. Spoon pork and sauce over. Scatter remaining 1/4 cup goat cheese over and serve.",
        "image_name": "big-island-wild-pig-with-cavatelli-363727"
    },
    "Cioppino": {
        "title": "Cioppino",
        "ingredients": "['1 teaspoon fennel seeds', '3 tablespoons olive oil', '1 medium onion, finely chopped', '1 small (or 1/2 large) fennel bulb, finely chopped', '4 garlic cloves, coarsely chopped', '3 bay leaves', '1 teaspoon dried oregano', '1/2 teaspoon crushed red pepper flakes', 'Kosher salt and freshly ground black pepper', '1 28-ounce can whole peeled tomatoes, crushed by hand, juices reserved', '1 1/2 cups dry white wine', '1 8-ounce bottle clam juice', '1 pound skinless fillets haddock or U.S. Pacific cod, cut into 1\" pieces', '1 pound mussels, scrubbed, debearded', '1 pound large uncooked shrimp, peeled and deveined, or frozen king crab legs, thawed', '1 pound cleaned squid, thawed if frozen, bodies cut into 1/2\" rings, tentacles left whole', 'Country-style bread']",
        "instructions": "Toast fennel seeds in a small skillet over medium heat until fragrant, about 2 minutes. Finely grind in a spice mill; set aside. Heat oil in a large heavy pot over medium-high heat. Add onion, fennel, garlic, bay leaves, oregano, and red pepper flakes. Season with salt and pepper. Cover, and cook, stirring occasionally, until onion and fennel are soft, about 12 minutes.\\r Stir in ground fennel seeds, tomatoes with juices, wine, clam juice, and 1 cup water. Cover, bring to a boil, reduce heat to medium-low, and cook, stirring often, until flavors meld, about 15 minutes. Stir in fish, mussels, and shrimp and bring to a simmer. Cover and cook for 2 minutes. Add squid, cover, and cook until mussels open and seafood is cooked through, about 5 minutes (discard mussels that do not open). Serve with bread.",
        "image_name": "cioppino-368957"
    },
    "Cold Soba Noodles": {
        "title": "Cold Soba Noodles",
        "ingredients": "['1 9.5 ounce package soba noodles', '1 cup shelled edamame', '1 small red bell pepper, julienne', '1 cup cubed firm tofu', '1/4 cup almond or peanut butter', '2 tablespoons vegannaise or mayonnaise', '2 tablespoons braggs liquid aminos or soy sauce', '1 tablespoon rice wine vinegar', '2 teaspoons honey or agave', '1 garlic clove', '1 inch piece ginger, peeled and chopped', '1 tablespoon sesame oil', '1/4 cup vegetable or grape seed oil']",
        "instructions": "Bring a large pot of water to a boil and add soba noodles. Reduce heat to a simmer.\\r Cook noodles for 2-3 minutes.\\r Drain and run under cold water until cool to touch.\\r Add the noodles to a large bowl with the edamame, bell pepper and tofu.\\r Place the almond butter and remaining ingredients in a blender or food processor and puree sauce.\\r Pour sauce over the noodles and toss to combine.\\r Serve.",
        "image_name": "cold-soba-noodles-51262810"
    },
    "Scotch Egg": {
        "title": "Scotch Egg",
        "ingredients": "['6 large eggs', '1 cup all-purpose flour', '1 cup finely crushed corn flakes', '7 ounces (3/4 cup) fresh breakfast sausage, casings removed (if necessary)', 'Vegetable oil (for frying)', 'Kosher salt, freshly ground pepper', 'Mustard', 'A deep-fry thermometer']",
        "instructions": "Place 4 eggs in a small saucepan; add cold water to cover. Bring to a boil; remove from heat, cover, and let stand for 3 minutes. Carefully drain, then fill pan with ice water to cool eggs. Gently crack shells and carefully peel under cold running water. Place eggs in a bowl of cold water; cover and chill until cold. DO AHEAD: Can be made 1 day ahead. Keep chilled.\\r Place flour in a wide shallow bowl and crushed corn flakes in another wide shallow bowl. Divide sausage into 4 equal portions. Pat 1 portion of sausage into a thin patty over the length of your palm. Lay 1 soft-boiled egg on top of sausage and wrap sausage around egg, sealing to completely enclose. Repeat with remaining sausage and eggs.\\r Whisk remaining 2 eggs in a medium bowl to blend. Working gently with 1 sausage wrapped egg at a time, dip eggs into flour, shaking off excess, then coat in egg wash. Roll in corn flakes to coat. DO AHEAD: Can be made 1 day ahead. Keep refrigerated, uncovered.\\r Attach a deep-fry thermometer to side of a large heavy pot. Pour in oil to a depth of 2\" and heat over medium heat to 375°F. Fry eggs, turning occasionally and maintaining oil temperature of 350°F, until sausage is cooked through and breading is golden brown and crisp, 5-6 minutes. Use a slotted spoon to transfer eggs to paper towels to drain. Season lightly with salt and pepper. Serve warm with mustard.",
        "image_name": "scotch-egg-380611"
    },
    "Apricot Almond Linzertorte": {
        "title": "Apricot Almond Linzertorte",
        "ingredients": "['2 cups whole almonds with skins (10 ounces), toasted and cooled completely', '3/4 cup sugar', '3/4 cup all-purpose flour', '1/2 teaspoon salt', '1/2 teaspoon cinnamon', '1/2 teaspoon ground ginger', '1/4 teaspoon ground cloves', '2 large egg yolks', '1 teaspoons pure vanilla extract', '1/8 teaspoon pure almond extract', '2 teaspoons grated lemon zest', '1 1/2 sticks cold unsalted butter, cut into 1/2-inch pieces', '1 cup water', '2/3 cup sugar', '1/3 cup brandy', '8 ounces dried Pacific apricots', 'Confectioners sugar for dusting', 'Equipment: a 10-inch springform pan']",
        "instructions": "Pulse toasted almonds and sugar in a food processor until nuts are finely ground. Sift together flour, salt, cinnamon, ginger, and cloves into a bowl, then add to ground nuts in processor and pulse to combine.\\r Lightly beat yolks, extracts, and zest in a small bowl with a fork. Add to food processor along with butter, then pulse until dough forms a ball. Form one third of dough into a disk, then roll out between 2 sheets of plastic wrap into a 10-inch round. Transfer to a baking sheet and chill until firm, about 10 minutes. Roll out remaining dough between 2 sheets of plastic wrap into a 12-inch round, then transfer to another baking sheet and chill until firm, about 10 minutes.\\r Simmer water, sugar, brandy, and apricots in a small saucepan, uncovered, stirring occasionally, until apricots are tender and liquid is syrupy, 15 to 20 minutes. Transfer mixture to cleaned food processor and pulse until almost smooth. Spread mixture onto a plate and chill 15 minutes.\\r Preheat oven to 350°F with rack in middle.\\r Remove bottom of springform pan and invert, then lock on side. Remove larger dough round from refrigerator and peel off top layer of plastic wrap, then invert round into pan (pastry will break in spots). Press dough evenly onto bottom, then discard plastic. Fold in edge of dough and press 1/2 inch up side of pan (side will be thicker than bottom). Press gently to close any cracks.\\r Bake pastry until lightly browned, about 20 minutes, then cool completely on a rack, about 30 minutes. (Dough will puff up as it bakes but will settle as it cools.)\\r Spread filling into crust with an offset spatula or back of a spoon.\\r Peel top layer of plastic wrap from smaller dough round, then cut round into 1/2-inch-wide strips. (Chill strips again if necessary.) Arrange half of strips over filling about 1 inch apart, pressing ends onto edge of torte. Arrange remaining strips across first strips to form a simple lattice. Press edges together with your fingertips.\\r Bake until top is browned, 40 to 50 minutes. Cool completely, about 2 hours.\\r Before serving, remove side of pan and dust edge of torte with confectioners sugar.",
        "image_name": "apricot-almond-linzertorte-351443"
    },
    "Hoisin-Glazed Meatloaf Sandwiches": {
        "title": "Hoisin-Glazed Meatloaf Sandwiches",
        "ingredients": "['3/4 cup hoisin sauce', '1/2 cup unseasoned rice vinegar', '1 1\" piece ginger, peeled, minced', '1 garlic clove, minced', 'Nonstick vegetable oil spray', '2 cups 1/2\" cubes day-old crustless white bread (from 2 slices)', '1/2 cup low-salt chicken broth', '4 slices bacon, minced', '1 1/3 cups thinly sliced scallions (dark-green parts separated)', '3 celery stalks, minced (about 1 cup)', '1 4\" piece ginger, peeled, minced', '7 garlic cloves, minced', '1 pound ground beef', '1 pound ground pork', '2 large eggs, beaten to blend', '3 whole star anise, finely ground in a spice mill (about 2 teaspoons ground), or 1 teaspoon Chinese five-spice powder', '2 teaspoons kosher salt', '1 teaspoon freshly ground black pepper', '1 cup each matchstick-size pieces peeled carrots, cucumbers, and radishes', '3/4 cup unseasoned rice vinegar', 'Pinch of kosher salt', 'Pinch of sugar', '4 teaspoons (or more) vegetable oil, divided', '12 thick slices white sandwich bread, toasted', '1 cup chopped fresh cilantro', 'Ingredient info: Hoisin sauce is available at many supermarkets and at Asian markets.', 'An 8 1/2x4 1/2x3\" loaf pan']",
        "instructions": "Bring all ingredients to a boil in a medium saucepan; reduce heat to low and cook, stirring often, until sauce thickens to a glaze, 8-10 minutes.\\r Preheat oven to 375°F. Coat the bottom and sides of loaf pan with nonstick spray and set aside. In a large bowl, soak bread cubes in chicken broth, stirring frequently, until liquid is absorbed and bread is beginning to fall apart, 4-5 minutes. Cook bacon in a large heavy skillet over medium heat until fat is rendered and bacon is starting to crisp. Add scallions (white and pale-green parts only), celery, ginger, and garlic; cook, stirring often, until vegetables begin to soften, 3-4 minutes. Let cool in pan for 5 minutes.\\r Combine scallion and bread mixtures in a large bowl. Add 2 tablespoons hoisin glaze, remaining scallions (dark-green parts), beef, pork, and remaining 4 ingredients. Using your hands, work all ingredients together until very well incorporated and mixture is beginning to get sticky. Pack mixture into prepared pan, pressing to eliminate any air pockets and mounding in center. Cover with foil. Line a rimmed baking sheet with foil; place loaf pan on top.\\r Bake meatloaf for 30 minutes. Uncover and spread 2 tablespoons hoisin glaze over top. Bake until an instant-read thermometer registers 165°F when inserted into center of meatloaf, about 1 hour longer.\\r Let meatloaf rest for 20 minutes. Using flexible spatulas, transfer meatloaf to a platter or cutting board. DO AHEAD: Can be made 1 day ahead. Let cool, cover, and chill.\\r Toss vegetables, next 3 ingredients, and 2 teaspoons oil in a medium bowl to coat. Cover and chill, tossing occasionally, for 1 hour or up to 1 day ahead.\\r Cut meatloaf into 12 slices. Heat 2 teaspoons oil in a large nonstick skillet over medium heat. Working in batches and adding additional oil by teaspoonfuls as needed, fry meatloaf slices until browned in spots and heated through, about 2 minutes per side.\\r Place toasts on plates; brush with hoisin glaze and top with a meatloaf slice. Drain salad, if using; mound on top of meatloaf, dividing equally. Garnish with cilantro.",
        "image_name": "hoisin-glazed-meatloaf-sandwiches-394694"
    },
    "Sauteed-Strawberry Ice Cream Sundaes": {
        "title": "Sauteed-Strawberry Ice Cream Sundaes",
        "ingredients": "['1 pound fresh strawberries, hulled, halved lengthwise', '1/4 cup sugar', '1/2 teaspoon ground cinnamon', '2 teaspoons olive oil', '1 teaspoon finely grated orange peel', '1 pint high-quality vanilla ice cream', '1 pint high-quality strawberry sorbet', '1/4 cup white, dark, and/or milk chocolate chips']",
        "instructions": "Mix berries, sugar, and cinnamon in medium bowl; toss to coat. Heat oil in medium nonstick skillet over high heat. Add berry mixture; cook until berries begin to soften and juices are released, stirring often, about 2 minutes. Stir in orange peel. Return to same bowl and place in freezer 10 minutes to cool slightly. DO AHEAD: Can be made 4 hours ahead. Cover, transfer to refrigerator, and chill. Return sauce to room temperature or rewarm slightly in microwave-safe bowl in microwave, if desired, before serving.\\r Divide vanilla ice cream among 4 large wineglasses or dessert coupes. Top with scoops of strawberry sorbet. Spoon room-temperature or warm strawberry sauce over. Sprinkle with chocolate chips and serve.",
        "image_name": "sauteed-strawberry-ice-cream-sundaes-241874"
    },
    "Concord Grape Jam": {
        "title": "Concord Grape Jam",
        "ingredients": "['5 lb Concord grapes, stemmed', '5 cups sugar', '3 tablespoons fresh lemon juice', '7 (1/2-pt) canning jars with lids and screw bands; a boiling-water canner or an 8- to 10-qt deep pot; an instant-read thermometer; a food mill fitted with fine disk']",
        "instructions": "Wash jars, lids, and screw bands in hot, soapy water, then rinse well. Dry screw bands. Put jars on a rack in canner or deep pot and add enough water to cover by 2 inches. Bring to a boil, covered, then boil for 10 minutes. Remove from heat, leaving jars in water. Heat lids in water to cover by 2 inches in a small saucepan until thermometer registers 180°F (do not let boil). Remove from heat, leaving lids in water. Keep the jars and lids submerged in hot water, covered, until ready to use.\\r Chill 2 small plates (for testing jam).\\r Slip skins from grapes and purée skins with 1 cup sugar in a food processor, then transfer to a 4- to 6-quart wide heavy pot. Stir in lemon juice, peeled grapes, and remaining 4 cups sugar and boil over moderate heat, stirring frequently and skimming foam, until pulp is broken down, about 20 minutes. Force jam through food mill set over a large bowl. Discard remaining solids. Return jam to pot and cook at a slow boil, skimming foam occasionally and stirring frequently as mixture thickens to prevent scorching, 35 minutes, then test for doneness.\\r To test jam, remove from heat, then drop a teaspoonful on a chilled plate and chill 1 minute. Tilt plate: Jam should remain in a mound and not run. If jam runs, continue cooking at a slow boil, testing every 5 minutes, until done, up to 25 minutes more.\\r Drain jars upside down on a clean kitchen towel 1 minute, then invert. Ladle jam into jars, leaving 1/4 inch of space at top. Wipe off rims of filled jars with a clean damp kitchen towel, then top with lids and firmly screw on screw bands. Put sealed jars on rack in canner or pot and add enough water to cover by 2 inches. Bring to a boil, covered, then boil 10 minutes. With tongs, transfer jars to a towel-lined surface to cool.\\r Jars will seal; if you hear a ping, it signals that vacuum formed at the top of cooling preserves has made lid concave. Remember that you may or may not be around to hear that ping (some jars make the sound after you remove them from water, and others in same batch may take a few hours); the important thing is for jars to eventually have concave lids. Preserves will thicken as they cool.\\r After jars have cooled 12 to 24 hours, press center of each lid to check that it's concave, then remove screw band and try to lift off lid with your fingertips. If you can't, lid has a good seal. Replace screw band. Put any jars that haven't sealed properly in the refrigerator and use them first.",
        "image_name": "concord-grape-jam-232813"
    },
    "Sheet-Pan Curry Pork Chops and Sweet Potatoes": {
        "title": "Sheet-Pan Curry Pork Chops and Sweet Potatoes",
        "ingredients": "['4 tsp. mild curry powder', '1 tsp. freshly ground black pepper', '1 tsp. light brown sugar', '2 1/2 tsp. kosher salt, divided', '1 Tbsp. extra-virgin olive oil', '4 (1\"-thick) small bone-in pork chops (about 2 lb. total)', '8 small sweet potatoes (about 1 1/2 lb.), scrubbed, sliced in half lengthwise', '1 cup plain whole-milk Greek yogurt', '3 Tbsp. fresh lemon juice', '4 small radishes, thinly sliced', '1 cup pomegranate arils']",
        "instructions": "Arrange a rack in top third of oven; preheat to 450°F. Stir curry, pepper, brown sugar, and 2 tsp. salt in a small bowl.\\r Rub an 18x13\" rimmed baking sheet with oil. Sprinkle pork chops and potatoes with spice mixture on prepared pan to evenly coat, then arrange in an even layer with potatoes cut side down.\\r Roast until pork is golden brown and cooked through and potatoes are deeply browned on cut sides and fork-tender, about 20 minutes. (The pork might finish cooking before the potatoes do; if so, transfer pork to a cutting board and let rest, then continue roasting the potatoes until done.)\\r Meanwhile, whisk yogurt, lemon juice, and remaining 1/2 tsp. salt in a medium bowl.\\r Arrange pork and potatoes on a platter. Top with yogurt sauce, radishes, and pomegranate arils.\\r Do Ahead: Yogurt sauce can be made 1 day ahead. Cover and chill.\\r Small sweet potatoes work best for cooking at the same rate as the pork chops and fitting on one sheet pan since you can tuck them between the chops. If you can’t find small sweet potatoes, use larger ones, cut them into wedges, and turn them halfway through roasting.",
        "image_name": "sheet-pan-curry-pork-chops-and-sweet-potatoes"
    },
    "Pumpkin Bread": {
        "title": "Pumpkin Bread",
        "ingredients": "['4 tablespoons unsalted butter, softened, plus more for the pan', '1 3/4 cups all-purpose flour', '1/2 teaspoon fine salt', '1 teaspoon baking soda', '1/2 teaspoon baking powder', '1 teaspoon ground cinnamon', '1/2 teaspoon freshly grated nutmeg', '1/4 teaspoon ground allspice', '1/4 teaspoon ground cloves', '1 1/2 cups sugar', '1/4 cup vegetable oil', 'Scant 1 cup canned pumpkin puree, not flavored pie filling', '2 large eggs']",
        "instructions": "1. Preheat the oven to 350°F. Butter a 9-inch loaf pan.\\r 2. Whisk together the flour, salt, baking soda, baking powder, cinnamon, nutmeg, allspice, and cloves in a small bowl.\\r 3. Beat the butter, sugar, and oil on high speed in the bowl of a stand mixer fitted with the paddle attachment, scraping down the sides and bottom of the bowl a few times, until light and fluffy, about 1 minute.\\r 4. Add the pumpkin puree and mix until combined. Add the eggs, one at a time, and mix until just incorporated. Mixing on low speed, slowly add the flour mixture and 2/3 cup water and mix until just combined. Spread the batter into the prepared pan and bake until a toothpick inserted into the center comes out clean, 1 hour to 1 hour 15 minutes. Let cool in the pan on a wire rack for 10 minutes. Remove from the pan and let cool completely.",
        "image_name": "pumpkin-bread-367512"
    },
    "Pizza Dough": {
        "title": "Pizza Dough",
        "ingredients": "['3/4 cup warm water (105°F to 115°F)', '1 envelope active dry yeast', '2 cups (or more) all purpose flour', '1 teaspoon sugar', '3/4 teaspoon salt', '3 tablespoons olive oil']",
        "instructions": "Pour 3/4 cup warm water into small bowl; stir in yeast. Let stand until yeast dissolves, about 5 minutes.\\r Brush large bowl lightly with olive oil. Mix 2 cups flour, sugar, and salt in processor. Add yeast mixture and 3 tablespoons oil; process until dough forms a sticky ball. Transfer to lightly floured surface. KNEAD dough until smooth, adding more flour by tablespoonfuls if dough is very sticky, about 1 minute. Transfer to prepared bowl; turn dough in bowl to coat with oil. Cover bowl with plastic wrap and let dough rise in warm draft-free area until doubled in volume, about 1 hour. PUNCH down dough. DO AHEAD Can be made 1 day ahead. Store in airtight container in refrigerator. ROLL out dough according to recipe instructions. (Start in center of dough, working outward toward edges but not rolling over them.)",
        "image_name": "pizza-dough-237338"
    },
    "Pear Crostata with Figs and Honey": {
        "title": "Pear Crostata with Figs and Honey",
        "ingredients": "['1 2/3 cups unbleached all purpose flour', '1/3 cup cornmeal', '2 tablespoons sugar', '1 teaspoon salt', '3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch cubes', '3 tablespoons (or more) ice water', '1/4 cup (packed) golden brown sugar', '1/4 cup sugar', '2 tablespoons cornstarch', '1 teaspoon (scant) ground cardamom', '1/4 teaspoon ground cloves', '1/4 teaspoon coarse kosher salt', '2 1/4 pounds firm but ripe unpeeled Anjou pears (about 4), cored, each cut into 8 wedges', '10 dried but moist Calimyrna figs (about 4 ounces), stemmed, quartered', 'Heavy whipping cream (for brushing)', 'Raw sugar', '2 tablespoons honey', 'Rimless baking sheet']",
        "instructions": "Blend first 4 ingredients in processor. Add butter; using on/off turns, process until mixture resembles coarse meal. Remove lid; spoon 3 tablespoons ice water over mixture. Return lid to processor; using on/off turns, blend mixture until dough forms ball, adding more ice water by teaspoonfuls if dry. Flatten dough into disk; wrap in plastic and chill at least 20 minutes. DO AHEAD: Can be made 2 days ahead. Keep chilled. Let dough soften slightly at room temperature before rolling out.\\r Position rack in center of oven; preheat to 400°F. Whisk first 6 ingredients in large bowl. Add pears and figs; toss gently. Roll dough out on lightly floured parchment to 14-inch square or round. Transfer parchment with rolled-out crust to rimless baking sheet. Mound pear mixture with juices in center of crust, leaving 2- to 3-inch plain dough border. Using parchment as aid, fold dough up over edges of pear mixture, pleating edges and pinching to seal any cracks in dough, forming square or round. Brush crust edges with cream; sprinkle generously with raw sugar.\\r Bake crostata until crust is golden, pears are tender, and juices are bubbling thickly, covering crust edges with foil if browning too quickly, 50 to 60 minutes. Remove crostata from oven; drizzle 2 tablespoons honey over hot filling. Run long thin knife or spatula around edges of warm crostata to loosen. Cool crostata on parchment on baking sheet until slightly warm, at least 1 hour. Transfer to platter. Serve slightly warm or at room temperature.",
        "image_name": "pear-crostata-with-figs-and-honey-361795"
    },
    "The Gold Rush": {
        "title": "The Gold Rush",
        "ingredients": "['1/2 cup vodka', '1/4 cup thawed frozen apple juice concentrate', '4 teaspoons Calvados', '4 teaspoons fresh lemon juice']",
        "instructions": "Combine vodka, apple juice concentrate, Calvados, and lemon juice in cocktail shaker; add ice. Cover and shake well. Strain into Martini glasses and serve.",
        "image_name": "the-gold-rush-236178"
    },
    "Pork Kebabs al Pastor": {
        "title": "Pork Kebabs al Pastor",
        "ingredients": "['3 dried chiles de árbol, wiped clean', '1 cup chopped fresh pineapple', '1/2 cup distilled white vinegar', '2 tablespoons vegetable oil', '2 large garlic cloves, smashed', '1 teaspoon dried oregano', '1/2 teaspoon ground cumin', '1 pound tomatoes (4 medium), halved', '1 small white onion (6 to 8 ounces), quartered', '3 tablespoons water', '1/4 cup chopped cilantro', '2 pounds boneless pork shoulder, cut into 1 1/2-inch chunks', '1 large white onion, cut into 1 1/2-inch pieces', '3 cups (1-inch) chunks fresh pineapple', '16 (6-inch) corn tortillas', 'Equipment: 12 (12-inch) wooden skewers, soaked in water 30 minutes', 'Accompaniments: fresh cilantro; lime wedges; thinly sliced radishes']",
        "instructions": "Heat a dry small heavy skillet over medium heat until hot, then toast chiles, turning and pressing with tongs, until more pliable and slightly changed in color, about 30 seconds. Stem chiles.\\r Purée 1 chile (reserve remainder for salsa) in a blender with pineapple, vinegar, oil, garlic, oregano, cumin, and 1 3/4 tsp salt, then transfer to a bowl.\\r Preheat broiler.\\r Oil a small baking pan, then add tomatoes and onion. Broil 4 to 6 inches from heat, turning occasionally, until tomatoes are wilted, skins are blistered, and onions begin to soften and are charred in spots, 16 to 18 minutes. Transfer to blender. Add remaining 2 toasted chiles, water, and 1 tsp salt and purée until smooth. Add cilantro and 1/2 cup pineapple basting sauce and pulse until cilantro is finely chopped.\\r Prepare grill for direct-heat cooking over medium-hot charcoal (medium-high heat for gas).\\r Toss pork with half of remaining pineapple basting sauce, then thread pork, onion, and pineapple onto skewers, leaving small spaces between pieces. Put on a tray. Wrap tortillas in 2 separate foil packages.\\r Oil grill rack, then grill skewers, covered only if using a gas grill, turning and basting frequently with remaining sauce (do not baste during last 3 minutes), until pork is cooked through, 8 to 10 minutes. Transfer to a platter and keep warm, covered.\\r Heat tortillas (in foil) on grill, turning once, until warmed through, about 3 minutes total.\\r Remove pork, pineapple, and onion from skewers. Serve wrapped in tortillas with salsa and other accompaniments.",
        "image_name": "pork-kebabs-al-pastor-242628"
    },
    "Apple Torte with Breadcrumb-Hazelnut": {
        "title": "Apple Torte with Breadcrumb-Hazelnut",
        "ingredients": "['2 pounds Granny Smith apples, peeled, cored, cut into 1/2-inch wedges', '1/3 cup sugar', '1 cup hard apple cider or dry white wine', '8 cups fresh breadcrumbs made from crustless Italian or French bread (finely ground in processor)', '1 cup hazelnuts, toasted , husked', '10 tablespoons sugar, divided', '4 teaspoons finely grated lemon peel', '1/4 teaspoon (generous) salt', '3/4 cup whole milk', '6 tablespoons (3/4 stick) unsalted butter, cut into 1-inch pieces', 'Powdered sugar (for dusting)', 'Whipped cream', '9-inch-diameter tart pan with removable bottom']",
        "instructions": "Arrange apples in even layer in heavy large skillet. Sprinkle with sugar, then pour apple cider over. Cover and cook over medium heat until apples are tender, gently turning apples occasionally, 8 to 10 minutes. Uncover; cook until juices evaporate, frequently but carefully turning apples to keep wedges intact, about 10 minutes. Remove from heat. Let apples cool completely in skillet. DO AHEAD: Can be made 1 day ahead. Transfer to bowl. Cover; chill.\\r Preheat oven to 350°F. Spread breadcrumbs on large rimmed baking sheet. Bake until dried and light golden, stirring occasionally, about 20 minutes. Cool.\\r Finely grind hazelnuts and 6 tablespoons sugar in processor. Add 3 cups breadcrumbs; process 5 seconds. Transfer mixture to large bowl. Stir in 4 tablespoons sugar, lemon peel, and salt. Combine milk and butter in small saucepan. Stir over medium heat just until butter melts. Pour milk-butter mixture over breadcrumb mixture; stir until moistened (dough will be sticky). Let dough rest in bowl until liquid is absorbed, about 15 minutes. Transfer 1 cup dough to floured work surface. Gather into ball; flatten into disk. Press out to 9-inch round; wrap in plastic. Chill at least 1 hour for top crust. Transfer remaining dough to work surface. Gather into ball; flatten into disk. Press disk onto bottom and up sides of 9-inch tart pan with removable bottom, pushing crust up to extend 1/2 inch above sides. Cover; chill at least 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled.\\r Preheat oven to 375°F. Fill crust with apple mixture. Place top crust over filling. Fold bottom crust overhang up over top crust edges, pressing together to seal.\\r Bake torte until crust is deep golden and crust begins to separate from sides of pan (top crust may crack), about 1 hour. Cool in pan on rack at least 2 hours. Carefully remove sides from tart pan. Transfer to platter. Dust with powdered sugar. Cut into wedges. Serve with whipped cream.",
        "image_name": "apple-torte-with-breadcrumb-hazelnut-361256"
    },
    "Deconstructed Falafel Salad": {
        "title": "Deconstructed Falafel Salad",
        "ingredients": "['Extra-virgin olive oil', '2 bunches of kale leaves (6 cups)', '1 Persian cucumber, sliced into thin rounds', '3 cups (150 g) store-bought pita chips', 'Handful of flat-leaf parsley leaves, roughly chopped', 'Handful of mint leaves', '1 lemon, cut into wedges', 'Sea salt', '18 ounces (500 g) cooked chickpeas (about 2 cans), drained and patted dry', 'Extra-virgin olive oil', '2 garlic cloves, finely chopped', '2 teaspoons ground cumin', '1 teaspoon paprika', 'Sea salt and black pepper', '1/3 cup (90 g) tahini paste', 'Juice of 1 lemon, plus more if needed', '1 garlic clove, very finely chopped', 'Sea salt and black pepper']",
        "instructions": "Preheat the oven to 425°F (220°C).\\r For the crispy roasted chickpeas, place the drained chickpeas into a small ovenproof dish. Cover with olive oil, season well with 2 big pinches of sea salt and black pepper, and add the garlic, cumin and paprika. Stir to combine. Roast for 35–40 minutes, until the chickpeas are crispy. Set aside.\\r Place a large frying pan over medium heat and drizzle with oil. Add the kale, in batches, along with a pinch of salt and cook for 2–3 minutes until wilted.\\r To make the lemon tahini, pour the tahini into a small bowl and whisk in the lemon juice and garlic. Gradually add 1 tablespoon of water at a time until the sauce is the consistency of thickened cream. If the tahini ‘seizes’ and becomes very thick, push through by adding more water; it will eventually come back together to form a cohesive creamy sauce. Season with sea salt and black pepper, and add more lemon juice if you like it lemony.\\r Combine the crispy chickpeas (and their cooking oil) with the kale, cucumber, half the pita chips and herbs. To serve, drizzle over the lemon tahini and scatter over the remaining pita chips. Serve with lemon wedges on the side.",
        "image_name": "deconstructed-falafel-salad"
    },
    "Rainbow Chard and Radicchio Sauté": {
        "title": "Rainbow Chard and Radicchio Sauté",
        "ingredients": "['2 pounds rainbow chard (3 to 4 medium bunches)', '2 tablespoons (1/4 stick) butter', '2 tablespoons olive oil', '1 medium onion, cut into 3/4-inch pieces', '4 garlic cloves, minced', '1 pound radicchio (about 2 large heads), cored, cut into 1-inch wedges, leaves separated (about 8 cups)', '2 tablespoons (or more) red wine vinegar', '3 tablespoons currants (optional)', '1/4 cup pine nuts, toasted']",
        "instructions": "Cut ribs from chard; chop crosswise into 1-inch pieces (about 4 cups). Slice leaves crosswise into 1-inch strips (about 16 cups).\\r Melt butter with oil in large pot over medium heat. Add onion and garlic; cook until onion is tender, stirring occasionally, about 4 minutes. Add chard ribs; cover and cook until tender, about 6 minutes. Working in batches, add chard leaves and radicchio, stirring until wilted. Cook uncovered until vegetables are tender, stirring often, 8 to 10 minutes. Stir in 2 tablespoons vinegar and currants, if desired. Season with salt and pepper and more vinegar, if desired.\\r Using slotted spoon, transfer chard mixture to bowl. Sprinkle pine nuts over.\\r The general rule is red with meat and white with fish, but Pinot Noir is a light red wine and salmon is a rich fish, so it works. We like the earthy, fruity GAINEY VINEYARD 2007 PINOT NOIR Ccalifornia, $48).",
        "image_name": "rainbow-chard-and-radicchio-saute-362533"
    },
    "Pumpkin Pie": {
        "title": "Pumpkin Pie",
        "ingredients": "['Pastry dough', '15-oz can canned solid-pack pumpkin (about 2 cups)', '1 cup heavy cream', '1/2 cup whole milk', '2 large eggs', '3/4 cup packed light brown sugar', '1 teaspoon ground cinnamon', '1 teaspoon ground ginger', 'Pinch of ground cloves', '1/4 teaspoon salt', 'Accompaniment: lightly whipped cream', 'pie weights or raw rice']",
        "instructions": "Make pastry dough as directed. Roll out dough into a 14-inch round on a lightly floured surface and fit into a 9-inch glass pie plate (4-cup capacity). Crimp edge decoratively and prick bottom all over. Chill 30 minutes.\\r Preheat oven to 375°°F.\\r Line shell with foil and fill with pie weights. Bake in middle of oven 20 minutes. Remove weights and foil and bake shell until pale golden, 6 to 10 minutes more. Cool in pan on a rack. Whisk together pumpkin, cream, milk, eggs, brown sugar, spices, and salt, then pour into shell.\\r Bake pie in middle of oven 45 to 50 minutes, or until filling is set but center still trembles slightly. (Filling will continue to set as pie cools.) Transfer to rack and cool completely.",
        "image_name": "pumpkin-pie-102601"
    },
    "Sesame Salt": {
        "title": "Sesame Salt",
        "ingredients": "['3/4 cup white and/or black sesame seeds', '1 tsp. flaky sea salt']",
        "instructions": "Toast sesame seeds in a dry medium skillet over medium-low heat, tossing often, until evenly deep golden brown, about 5 minutes. Transfer to a food processor and let cool.\\r Add sea salt to sesame seeds and pulse until about half of the seeds are pulverized (there should still be some whole seeds), 6–8 pulses. (Alternatively, coarsely grind in a mortar and pestle.)\\r Do Ahead: Sesame salt can be made 1 week ahead. Store airtight at room temperature.",
        "image_name": "sesame-salt"
    },
    "Seafood Pasta with Lemon-Saffron Herb Dressing": {
        "title": "Seafood Pasta with Lemon-Saffron Herb Dressing",
        "ingredients": "['12 ounces campanelle (trumpet-shaped pasta) or macaroni', '1/8 teaspoon crushed saffron threads', '7 tablespoons fresh lemon juice, divided', '6 tablespoons extra-virgin olive oil, divided', '1/2 cup mayonnaise', '1/2 cup sour cream', '1/4 cup thinly sliced green onions', '2 tablespoons drained capers', '2 tablespoons minced fresh tarragon plus sprigs for garnish', '1 tablespoon minced fresh dill plus sprigs for garnish', '1 teaspoon sugar', '1 pound cooked medium shrimp', '1 cup finely chopped celery', '1/2 pound Dungeness crabmeat', '2 large handfuls of arugula', '2 small heads of butter lettuce', 'Lemon wedges']",
        "instructions": "Cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain, reserving 1/2 cup cooking liquid. Place 3 tablespoons hot cooking liquid in medium bowl. Sprinkle saffron over and let stand at room temperature 5 minutes. Transfer pasta to large bowl. Drizzle pasta with 1 tablespoon lemon juice and 1 tablespoon oil; toss to coat. Let stand at room temperature until cool, stirring occasionally.\\r Add mayonnaise, sour cream, green onions, capers, minced tarragon, minced dill, sugar, remaining 6 tablespoons lemon juice, and remaining 5 tablespoons oil to bowl with saffron liquid. Whisk to combine. Season saffron dressing to taste with salt and pepper. Pour dressing over pasta. Add shrimp and celery; toss to coat. Add reserved pasta cooking liquid by tablespoonfuls if mixture is dry. Add crab; toss gently. Cover and refrigerate at least 1 hour and up to 4 hours.\\r Line platter with arugula and butter lettuce leaves. Spoon pasta over greens. Garnish with lemon wedges and tarragon and dill sprigs. Serve cold.",
        "image_name": "seafood-pasta-with-lemon-saffron-herb-dressing-232554"
    },
    "Carrot, Yellow Beet, and Apple Slaw with Caraway Seed Dressing": {
        "title": "Carrot, Yellow Beet, and Apple Slaw with Caraway Seed Dressing",
        "ingredients": "['6 medium multicolored carrots (about 10 ounces), peeled', '4 small golden beets (about 8 ounces), peeled', '1 Fuji apple', '1/2 cup full-fat Greek yogurt', '1/4 cup mayonnaise', '2 tablespoons apple cider vinegar', '2 teaspoons honey', '3/4 teaspoon whole caraway seeds', '1 teaspoon kosher salt, plus more to taste', '1/2 teaspoon freshly ground black pepper, plus more to taste', '5 leaves Tuscan kale, thick stems removed, thinly sliced crosswise']",
        "instructions": "Using the coarse grater disk on a food processor or the largest holes on a box grater, coarsely grate carrots, beets, and apple into a large bowl.\\r Whisk yogurt, mayonnaise, vinegar, honey, caraway seeds, 1 tsp. salt, and 1/2 tsp. pepper in another large bowl until smooth.\\r Add carrots, beets, apple, and kale and toss to combine. Season with salt and pepper. Cover and chill until ready to serve.\\r Slaw can be made and chilled for up to 8 hours.",
        "image_name": "carrot-yellow-beet-and-apple-slaw-with-caraway-seed-dressing-56389807"
    },
    "Homemade Cheese Spread with Garlic and Herbs": {
        "title": "Homemade Cheese Spread with Garlic and Herbs",
        "ingredients": "['8 ounces cream cheese, softened', '2 tablespoons unsalted butter, softened', '1 small garlic clove, quartered', '1/4 teaspoon kosher salt', '1/4 cup chopped parsley leaves', '1 tablespoon chopped chives', 'Crackers or toasts (for serving)']",
        "instructions": "Combine cream cheese, butter, garlic, and salt in the bowl of a food processor. Pulse until smooth. Add parsley and chives and pulse a few times until well combined. Pack mixture into a small bowl, ramekin, or glass jar. Cover and chill at least 30 minutes. Serve with crackers or toasts.\\r Cheese can be made 5 days ahead. Cover and chill.",
        "image_name": "homemade-cheese-with-garlic-and-herbs"
    },
    "Grilled Peaches with Black Pepper and Basil-Lime Syrup": {
        "title": "Grilled Peaches with Black Pepper and Basil-Lime Syrup",
        "ingredients": "['1/2 cup brown sugar, plus more, for sprinkling', '1/4 cup water', '1/4 cup fresh lime juice', '1/4 cup basil leaves, plus thinly sliced basil, for garnish', 'Vegetable oil, for grilling', '4 large peaches, quartered and pitted', 'Freshly ground black pepper']",
        "instructions": "In a saucepan over medium heat, combine the 1/2 cup brown sugar with the water and stir until dissolved. Turn off the heat and add the lime juice and basil leaves. Let stand for at least 15 minutes or up to 1 hour, then discard the basil leaves.\\r Light a grill or preheat a grill pan over medium heat; lightly oil the grates.\\r Lightly sprinkle the peaches with brown sugar and grill cut side down until dark brown grill marks form, about 2 minutes per cut side. Transfer the peaches to bowls and season with a little black pepper. Spoon some of the syrup on top, sprinkle with basil leaves and serve.",
        "image_name": "grilled-peaches-with-black-pepper-and-basil-lime-syrup-51241460"
    },
    "Yogurt-Braised Chicken Legs with Garlic and Ginger": {
        "title": "Yogurt-Braised Chicken Legs with Garlic and Ginger",
        "ingredients": "['4 whole chicken legs (thigh and drumstick), patted dry with paper towels', 'Kosher salt, freshly ground pepper', '2 Tbsp. extra-virgin olive oil', '1 head of garlic, halved crosswise, plus 1 clove', '1 (3\") piece ginger, peeled, scrubbed, thinly sliced', '1 Tbsp. coriander seeds', '1 Tbsp. cumin seeds', '1/2 tsp. crushed red pepper flakes', '1 tsp. ground turmeric', '3 cups plain whole-milk yogurt (not Greek), divided', '1 (15-oz.) can chickpeas, rinsed', 'Thinly sliced scallions, mint leaves, and lime wedges (for serving)']",
        "instructions": "Generously season chicken legs all over with salt and pepper. Heat oil in a medium Dutch oven over medium. Arrange chicken legs in pot skin side down (you want them to fit snugly) and cook, lifting up once or twice to let hot fat run underneath, until skin is golden brown and crisp, 10–15 minutes. Transfer chicken to a plate, placing skin side up.\\r Reduce heat to medium-low and add head of garlic, cut sides down, and ginger to pot. Cook, stirring occasionally, until ginger is starting to brown and curl around the edges and garlic is golden, about 4 minutes. Add coriander, cumin, and red pepper flakes and cook, stirring often, until spices are fragrant, about 1 minute. Stir in turmeric followed by 2 cups yogurt and mix until smooth; season with salt.\\r Nestle legs back into pot, skin side up, in a single layer and add water just until legs are almost submerged with skin barely peeking out. Bring to a very gentle simmer, adjusting heat if needed, and cook, uncovered, until meat is very tender and just about falling off the bone, 75–90 minutes (the yogurt will separate and look curdled, which is fine). Let cool 10 minutes.\\r Meanwhile, finely grate remaining garlic clove into a small bowl. Add remaining 1 cup yogurt and stir to combine; season with salt and pepper.\\r Smear yogurt mixture across a platter and scatter chickpeas over. Carefully transfer chicken legs to platter. Using a large spoon or small ladle, skim off bright yellow fat that has collected on surface of braising liquid and drizzle all over platter (it’s okay if some rogue spices make it onto platter). Top with scallions and mint, then squeeze lime wedges over.",
        "image_name": "yogurtbraised-chicken-legs-with-garlic-and-ginger"
    },
    "French Bread Pudding": {
        "title": "French Bread Pudding",
        "ingredients": "['1 loaf of stale French bread', '1 quart milk', '3 eggs', '1 1/2 cups sugar', '2 tablespoons pure vanilla extract', '1 cup dried cherries', 'Heavy cream, for serving']",
        "instructions": "1. Cut bread in 1-inch cubes and place in a bowl. Pour milk over it; let stand for 1 hour.\\r 2. Preheat the oven to 325°F. Butter the bottom and sides of a 9x13x2-inch ovento- table baking dish.\\r 3. In another bowl, beat together the eggs, sugar, and vanilla. Stir this into the bread mixture. Add the dried cherries.\\r 4. Pour into the prepared baking dish. Bake on the middle rack of the oven for about 1 hour and 10 minutes, or until golden brown. Cool to room temperature, cover with aluminum foil, and refrigerate overnight.\\r 5. Remove from the refrigerator 30 minutes before reheating. Reheat, covered with foil, at 325°F for 15 to 20 minutes. Serve warm or at room temperature. Pass a pitcher of cream to moisten.",
        "image_name": "french-bread-pudding-351110"
    },
    "French Toast Fingers With Chocolate Hazelnut Spread and Blueberries": {
        "title": "French Toast Fingers With Chocolate Hazelnut Spread and Blueberries",
        "ingredients": "['2 cups half and half (500 mililiters)', '1 tablespoon honey', '1/2 ounce butter (15 grams) butter', 'Zest of 1 orange', '1 vanilla bean, split and seeds scraped', '4 eggs', '5 1/2 ounces caster (superfine) sugar (150 grams)', '1 brioche loaf', '2 tablespoons homemade chocolate hazelnut spread', '1 cup blueberries (9 1/2 ounces/270 grams)', '1 1/2 fluid ounces coconut oil (50 milliliters)']",
        "instructions": "Preheat oven to 325°F (175°C).\\r Put the cream, honey, butter, orange zest and vanilla bean in a medium saucepan over medium-high heat. Bring to a boil, stirring, and remove from the heat.\\r Put the eggs and sugar in a large bowl and whisk to combine.\\r Pour the hot cream mixture over the egg mixture and whisk to combine.\\r Using a bread knife, cut the crust off the brioche loaf to create a square log. Slice the loaf in half lengthways. Spread both halves with chocolate hazelnut spread, like you’re making a big sandwich, then add the blueberries to the middle and close the sandwich.\\r Soak the brioche loaf in the warm egg custard for 10 minutes, or until it’s well soaked.\\r Put coconut oil in a medium pan over medium heat and cook the brioche loaf until it’s golden brown all over, then finish in the oven for 5 minutes. Transfer to a plate lined with paper towel and slice into fingers.",
        "image_name": "french-toast-fingers-with-chocolate-hazelnut-spread-and-blueberries"
    },
    "Plum and Polenta Cake": {
        "title": "Plum and Polenta Cake",
        "ingredients": "['1/2 cup plus 2 tablespoons finely ground cornmeal or semolina flour', '1 cup all-purpose flour', '1 1/2 teaspoons baking powder', 'Pinch of kosher salt', '13 tablespoons butter, softened', '3/4 cup granulated sugar', '4 large egg yolks', '2 large eggs', '1 teaspoon grated lemon zest', '1 teaspoon pure vanilla extract', '4 plums, cut in half and pitted', '2 tablespoons packed light brown sugar']",
        "instructions": "1. Preheat the oven to 350 °F. Grease and lightly flour an 8 x 2-inch round cake pan or an 8-inch springform pan, tapping out any excess flour. Set aside.\\r 2. In a small bowl, toss the cornmeal, all-purpose flour, baking powder, and salt. Set aside.\\r 3. In a large bowl, beat the butter and granulated sugar together with an electric mixer, until pale yellow and creamy, about 5 minutes. Scrape down the sides of the bowl with a rubber spatula and add the egg yolks, one at a time, beating after each addition. Scrape down the sides of the bowl and add the whole eggs, one at a time, beating after each addition. Mix in the lemon zest and vanilla. Add the dry ingredients and blend until just combined.\\r 4. Spread the batter in the prepared pan. Place the plum halves, skin side down, at even intervals on top of the batter. Sprinkle the brown sugar on top of the fruit and batter. Bake until the cake is golden brown on top and a toothpick inserted in the center comes out clean, about 45 minutes.",
        "image_name": "plum-and-polenta-cake-51119620"
    },
    "Skillet Cod, Clams, and Corn with Parsley": {
        "title": "Skillet Cod, Clams, and Corn with Parsley",
        "ingredients": "['1 1/4 lb. skinless cod fillet, cut into 4 pieces, patted dry', 'Kosher salt, freshly ground pepper', '1/3 cup all-purpose flour', '4 Tbsp. extra-virgin olive oil, divided', '1 large shallot, finely chopped', '1/3 cup dry white wine', '12 littleneck clams, scrubbed', '2 medium ears of corn, kernels cut from cobs (1–1¼ cups)', '3 Tbsp. unsalted butter, cut into pieces', '1/4 cup chopped parsley', 'Lemon wedges (for serving)']",
        "instructions": "Season cod all over with salt and pepper. Sprinkle flour over a large plate and, working one at a time, press side of fillet where skin used to be into flour to thoroughly coat. Tap off excess and set on a platter, flour side up.\\r Heat 2 Tbsp. oil in a large nonstick skillet with a tight-fitting lid over medium. Cook cod, floured side down, shaking skillet occasionally to prevent sticking, until flesh is opaque and starting to flake around the sides and underside is golden brown, 5–7 minutes. Carefully turn cod over and reduce heat to low. Cook until cooked all the way through (flesh should be completely opaque), about 2 minutes (thinner pieces may go more quickly). Place on platter, golden side up; take care not to break up the delicate fillets.\\r Turn heat back up to medium, pour remaining 2 Tbsp. oil into skillet, and cook shallot, stirring often, until tender and golden, about 2 minutes. Add wine; cook until almost completely evaporated, about 1 minute. Add clams and cover skillet. Cook until clams open, about 5 minutes (some clams might take a few minutes longer). Uncover skillet and transfer clams, discarding any that didn’t open, to platter with cod.\\r Reduce heat to low and add corn and butter to skillet. Cook, stirring, until butter is melted, sauce is thick and glossy, and corn is tender, about 3 minutes. Spoon corn mixture over fish and clams. Top with parsley; squeeze lemon wedges over.",
        "image_name": "skillet-cod-clams-and-corn-with-parsley"
    },
    "Grilled Lamb and Fig Skewers with Mint-Pepper Glaze and Grilled Eggplant": {
        "title": "Grilled Lamb and Fig Skewers with Mint-Pepper Glaze and Grilled Eggplant",
        "ingredients": "['2/3 cup apricot jam', '1/3 cup red wine vinegar', '1 tablespoon red pepper flakes', '1 tablespoon finely grated lemon zest (from about 1 lemon)', '1/4 cup fresh mint, chopped', '1 tablespoon whole cumin seeds', '1 tablespoon whole coriander seeds', '3 pounds boneless leg of lamb, fat trimmed, cut into 1-inch cubes', '12 fresh figs, halved vertically', '1/4 cup olive oil', '2 medium cloves garlic, minced (about 2 tablespoons)', '1 tablespoon kosher salt', '1 tablespoon freshly coarse-ground black pepper', '2 eggplants, unpeeled, cut into 1-inch-thick slices', '1/4 cup olive oil', '1 tablespoon kosher salt', '1 tablespoon freshly coarse-ground black pepper', 'about 30 (12-inch) metal skewers']",
        "instructions": "In small saucepan over moderate heat, stir together jam, vinegar, red pepper flakes, and lemon zest. Bring to boil, then lower heat to low and simmer, uncovered, stirring occasionally, until slightly thickened, about 10 minutes. Remove from heat and allow to cool 5 minutes. Stir in mint and set aside.\\r If using charcoal grill, open vents on bottom, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 4 to 5 seconds. If using gas grill, preheat burners on high with hood closed 10 minutes, then turn down to moderately high.\\r In electric spice mill or clean coffee grinder, combine cumin and coriander seeds. Pulse several times to coarsely grind. In large bowl, toss together lamb, figs, and olive oil. Add garlic, ground cumin and coriander, salt, and pepper, and toss gently to combine. Thread lamb cubes and figs onto skewers.\\r Arrange eggplant slices on platter. Rub each slice on both sides with oil and sprinkle with salt and pepper.\\r Arrange skewers and eggplant on grill. Cook eggplant, turning once, until slices are golden and moist, about 3 to 4 minutes per side. Cook lamb to slightly less than desired doneness (cubes will continue to cook after being removed from grill), turning once and brushing with glaze during last 30 seconds of grilling on each side, about 4 minutes per side for medium-rare.\\r Arrange eggplant slices on serving platter, top with skewers, and serve.",
        "image_name": "grilled-lamb-and-fig-skewers-with-mint-pepper-glaze-and-grilled-eggplant-238566"
    },
    "Easy Fruit Tart with Pecan Cookie Crust": {
        "title": "Easy Fruit Tart with Pecan Cookie Crust",
        "ingredients": "['3 1/2 cups vanilla wafer cookies (about 55)', '1 cup pecans', '1/3 cup sugar', '1/2 teaspoon kosher salt, divided', '6 tablespoons unsalted butter, melted, cooled slightly', '1 1/2 cups heavy cream', '2/3 cup homemade or store-bought lemon curd', 'Berries, mango, and other fresh fruit (for serving)', 'A 10\" fluted tart pan']",
        "instructions": "Preheat oven to 350°F. Pulse cookies, pecans, sugar, and 1/4 tsp. salt in a food processor until finely ground. Add butter and pulse until dough sticks together when squeezed with your fingertips. Transfer dough to pan and press into bottom and up sides of pan. Chill until set, about 15 minutes.\\r Transfer pan to a rimmed baking sheet and bake shell until golden, 18-20 minutes. Let cool.\\r Using an electric mixer on high speed, whip cream in a large bowl until soft peaks form. Fold in lemon curd and remaining 1/4 tsp. salt, then whip on medium-high speed until medium peaks form.\\r Spoon lemon curd mixture into tart shell and top with fruit. Chill 15 minutes to set, then serve.\\r Tart shell can be baked 3 days ahead. Let cool, tightly wrap with plastic, and store at room temperature.",
        "image_name": "easy-fruit-tart-with-pecan-cookie-crust"
    },
    "Raspberry Cream Cheese Brownies": {
        "title": "Raspberry Cream Cheese Brownies",
        "ingredients": "['6 tbsp unsalted butter, room temperature, divided, plus more', '1/2 cup plus 1 tbsp all-purpose flour, divided, plus more', '4 oz bittersweet chocolate, coarsely chopped', '3 large eggs, divided', '3/4 cup plus 2 tbsp sugar, divided', '1/2 tsp baking powder', '1/2 tsp salt', '1 1/2 tsp vanilla extract, divided', '4 oz cream cheese, room temperature', '2 tbsp raspberry jam', '1/2 cup fresh raspberries']",
        "instructions": "Preheat oven to 350° with rack in upper third. Grease an 8\" x 8\" pan with butter, line with parchment paper, and grease and flour parchment paper.\\r Put chocolate and 4 Tbsp butter in a heatproof bowl set over a saucepan of 2\" simmering water. Melt, stirring occasionally, about 5 minutes. Remove from heat; let cool slightly.\\r In a small bowl, beat 2 eggs. Whisk eggs into chocolate mixture. Add 3/4 cup sugar and beat until combined. Add 1/2 cup flour, baking powder, and salt. Stir well. Stir in 1 tsp vanilla. Spread batter in prepared pan.\\r For the cream cheese layer: In a medium bowl, stir together cream cheese and remaining 2 tbsp butter until smooth and thoroughly combined. Add remaining 2 tbsp sugar, remaining egg, and jam and mix well. Stir in remaining 1 tbsp flour and remaining 1/2 tsp vanilla. Dollop mixture onto batter in pan. Use a butter knife to swirl cream cheese mixture into brownies. Press fresh raspberries into the top.\\r Bake until a wooden pick inserted into center comes out with only a few moist crumbs, 35-40 minutes (check after 30 minutes). Let cool completely before slicing and serving.\\r The brownies will keep, wrapped individually and stored in the refrigerator, up to 4 days.",
        "image_name": "raspberry-cream-cheese-brownies-51256870"
    },
    "Classic Cassoulet": {
        "title": "Classic Cassoulet",
        "ingredients": "['6 duck legs', '6 Tbsp. Diamond Crystal or 3 Tbsp. plus 2 1/2 tsp.', '4 sprigs thyme', '4 garlic cloves, smashed', '2 tsp. black peppercorns', '1 tsp. juniper berries (optional)', '2 whole cloves', '1 large onion, halved through root end', '1 1/2 lb. dried Tarbais, corona, or cannellini beans, soaked overnight, drained', '8 oz. pancetta (leave in 1 thick piece)', '2 carrots, scrubbed, halved crosswise if large', '1 head of garlic, halved crosswise', '4 sprigs thyme', '1 bay leaf', 'Kosher salt, freshly ground black pepper', '1 1/2 lb. skinless, boneless pork shoulder (Boston butt), cut into 1\" pieces', '1 1/2 tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus more', 'Freshly ground black pepper', '2 Tbsp. vegetable oil', '1 large onion, peeled, chopped', '1 large carrot, peeled, chopped', '4 garlic cloves, finely chopped', '4 sprigs thyme', '1 bay leaf', '1 (14.5-oz.) can crushed tomatoes', '6 cups chicken stock or low-sodium chicken broth', 'Kosher salt, freshly ground pepper', '1 lb. fresh pork sausage (such as Toulouse, sweet Italian, or unsmoked kielbasa)', '3 cups medium-fine fresh breadcrumbs, divided', '1/4 cup finely chopped parsley', '1 garlic clove, halved lengthwise', '1 lb. precooked garlic sausage, sliced crosswise 1/4\" thick (optional)']",
        "instructions": "Cure duck legs:\\r Prick skin on duck legs all over with the tip of a paring knife. Rub legs with salt, making sure to massage into flesh and skin.\\r Place legs in a large bowl and cover with plastic wrap, pressing directly onto legs. Rest a plate on top of legs and weigh down with several 28-oz. cans. Chill at least 12 hours and up to 1 day.\\r NOTE: If you’re going to cook the beans and ragout tomorrow, soak the beans tonight. If not, just remember to soak them the day before you want to cook them.\\r Confit duck legs:\\r Preheat oven to 250°F. Evenly scatter thyme, garlic, peppercorns, and juniper berries (if using) across a large baking dish or roasting pan and add 2 Tbsp. water.\\r Remove duck legs from bowl. Rinse off salt and arrange legs, skin side down, over aromatics in baking dish. Cover dish tightly with foil and weigh down with a cast-iron skillet or a heavy baking dish. Bake until fat renders out of duck and legs are submerged, about 2 hours.\\r Carefully remove baking dish from oven and remove skillet and foil. Turn legs skin side up and nestle back into fat. Cover dish again with foil and continue to cook legs, unweighted, until duck meat is very tender and bones wiggle easily in joints, 2–2 1/2 hours longer.\\r Let legs cool in fat until you can handle them, then transfer with tongs or a spider to a plate. Strain 1/4 cup fat through a fine-mesh sieve into a small bowl and let cool. Cover and set aside for cooking the breadcrumbs. Strain remaining fat into an airtight container; cover and reserve for another use (like roasting potatoes).\\r Remove skin from legs, trying to keep as intact as possible; transfer skin to an airtight container. Cover and chill. Pull duck meat from bones, tearing into 2\" pieces; discard bones and cartilage. Place meat in another airtight container; cover and chill. You won’t need the skin, meat, or fat until you’re ready to assemble the cassoulet.\\r DO AHEAD: Duck legs can be confited 3 weeks ahead. Transfer legs to a large nonreactive vessel; strain fat through a fine-mesh sieve over meat. Cover and chill. Let come to room temperature before using. Meat and skin can be prepared 3 days ahead; keep chilled.\\r Cook the beans:\\r Stick a clove into each onion half. Place in a large pot along with beans, pancetta, carrots, garlic, thyme, and bay leaf; pour in cold water to cover beans by 2\". Season with several grinds of pepper [3] and bring to a gentle simmer. Partially cover pot and cook beans, skimming surface occasionally and adding more water as needed to keep beans submerged and seasoning with a couple of pinches of salt after about 30 minutes, until beans are tender but not falling apart, 45–60 minutes for cannellini and 1–1½ hours for Tarbais or corona. Remove pot from heat; pluck out and discard onion, carrots, garlic, thyme, and bay leaf. Transfer pancetta to a cutting board; let cool slightly, then cut into 1x1/4\" pieces. Add back to pot and let mixture cool.\\r Cook ragout:\\r Meanwhile, sprinkle pork with 1 1/2 tsp. Diamond Crystal or 1 tsp. Morton kosher salt and several grinds of pepper. Heat oil in a large Dutch oven or other heavy pot over medium-high. Working in 2 batches, cook pork, turning once, until browned all over, 10–12 minutes per batch; transfer to a plate as you go.\\r Reduce heat to medium and place onion, carrot, and garlic in pot; season with salt and pepper. Cook, stirring occasionally, until softened and lightly browned, 8–10 minutes. Return pork to pot and add thyme, bay leaf, tomatoes, and stock. Bring to a boil. Reduce heat, partially cover pot, and simmer gently, skimming fat occasionally, until meat is fork-tender, 1 3/4–2 hours. Pluck out and discard thyme and bay leaf. Let ragout cool slightly.\\r Combine beans and ragout:\\r Using a slotted spoon, transfer bean mixture to pot with ragout. Add enough cooking liquid from beans just to cover. Pour remaining bean cooking liquid into an airtight container and chill; you may need it for finishing the cassoulet later. Let ragout mixture cool completely, then cover and chill at least 12 hours.\\r DO AHEAD: Ragout and beans can be combined 2 days ahead. Keep chilled.\\r Temper and season ragout mixture:\\r Remove ragout mixture from refrigerator and skim fat from surface; discard. Cover pot and bring ragout to a gentle simmer over medium-low heat. Taste and season conservatively with salt and pepper if needed (the duck will add considerable saltiness when mixed in).\\r Prepare sausage and breadcrumbs:\\r Remove reserved duck meat and skin from refrigerator. Let meat come to room temperature.\\r Meanwhile, arrange skin in a single layer in an 8-qt. Dutch oven or other heavy pot (the same one you’ll cook the cassoulet in). Cook over low heat, turning occasionally, until golden brown and crisp, 20–30 minutes. Using tongs, transfer skin to paper towels and blot away excess fat.\\r Prick pork sausages all over with a fork and cook in fat in same pot, turning occasionally, until browned all over and cooked through, 12–15 minutes. Transfer to a plate and let cool slightly. Cut into 2\" pieces.\\r Add breadcrumbs to pot and cook, stirring often, until golden in spots and starting to crisp, about 5 minutes. If breadcrumbs seem very dry or are sticking to the pot, add 1–2 Tbsp. reserved duck fat. Transfer breadcrumbs to a medium bowl and let cool slightly. Add parsley and toss to combine. Wipe out pot and let cool.\\r Layer cassoulet:\\r Rub inside of cooled pot with cut sides of garlic; ladle in one-third of ragout mixture. Top with half of pork sausage, garlic sausage, and duck meat, then another third of ragout mixture. Top with remaining duck meat and sausages, then remaining ragout mixture. Liquid should come to top of beans. Add reserved bean cooking liquid if needed.\\r DO AHEAD: Cassoulet can be assembled 1 day ahead; cover and chill. Bring to room temperature before proceeding. Store breadcrumbs and duck skin separately airtight at room temperature.\\r Bake cassoulet:\\r Preheat oven to 375°F. Scatter two-thirds of breadcrumb mixture over cassoulet.\\r Bake, uncovered, until a golden crust forms, 25–30 minutes. Remove from oven and use a spoon to break up crust, pressing very gently so crust absorbs a little liquid; smooth surface. Bake until another crust forms, 25–30 minutes; break up again. Repeat process 2 more times (for a total of 4 times). If mixture starts to look dry, moisten with a bit of reserved bean cooking liquid when breaking up the crust.\\r Top cassoulet with remaining breadcrumb mixture; bake until golden brown, 15–20 minutes. Let rest at least 25 minutes before serving.\\r Divide cassoulet among bowls; crumble duck skin over.",
        "image_name": "classic-cassoulet"
    },
    "Quiche Sardou": {
        "title": "Quiche Sardou",
        "ingredients": "['1/2 cup (1 stick) chilled unsalted butter, cut into cubes', '1/8 teaspoon kosher salt', '1 1/4 cups all-purpose flour, plus more for surface', '1 large egg yolk', '5 ounces baby spinach (about 4 packed cups)', '2 tablespoons unsalted butter', '1 medium onion, thinly sliced', '1/2 cup frozen artichoke hearts, thawed, coarsely chopped', '1 teaspoon kosher salt', '1/2 teaspoon freshly ground black pepper', '4 large eggs', '2/3 cup heavy cream', '2/3 cup whole milk', 'A 9-9 1/2-inch round fluted tart pan (1 inch deep) with removable bottom; pie weights or raw rice']",
        "instructions": "Pulse butter, salt, and 1 1/4 cups flour in a food processor until mixture resembles coarse meal with a few pea-size pieces of butter remaining. Add 1/4 cup ice water; pulse 1–2 times just until moistened. Turn out dough and gather into a ball, kneading once or twice. Flatten into a disc, wrap in plastic, and chill until firm, about 30 minutes.\\r Position rack in middle of oven and preheat oven to 375°F. Roll out dough on a lightly floured surface to an 11\" round. Press into bottom and up sides of tart pan; trim excess. Prick bottom of shell all over with a fork and freeze 10 minutes.\\r Line shell with parchment paper and fill with pie weights. Bake until pastry is nearly dry, about 30 minutes.\\r Beat egg yolk with 2 Tbsp. water in a small bowl just to combine. Remove parchment and pie weights and brush bottom and sides of shell lightly with egg yolk mixture. Return to oven and continue baking until lightly golden, about 25 minutes more. Let cool on a wire rack. Reduce oven temperature to 350°F.\\r Cook spinach and 2 Tbsp. water in a large skillet, stirring occasionally, until wilted, about 5 minutes. Transfer spinach to a colander; reserve skillet. Drain spinach, pressing out excess liquid, then coarsely chop.\\r Melt butter in same skillet over medium heat. Add onion and cook, stirring occasionally, until caramelized, about 15 minutes. Add artichokes and cook, stirring, until warmed through, about 5 minutes more. Stir in chopped spinach and season with salt and pepper. Spread vegetable mixture into crust.\\r Whisk eggs, cream, and milk in a medium bowl and pour over vegetable mixture. Bake quiche until set and lightly golden, 30–35 minutes. Transfer to a wire rack and let cool 15 minutes. Serve warm or at room temperature.\\r Crust can be baked 1 day ahead; let cool and store tightly wrapped at room temperature. Filling can be prepared 1 day ahead; keep chilled. Return to room temperature before filling crust.",
        "image_name": "quiche-sardou"
    },
    "Smashed Fingerlings with Jalapeños": {
        "title": "Smashed Fingerlings with Jalapeños",
        "ingredients": "['3 pounds fingerling potatoes, halved crosswise if large', '1/2 cup olive oil, divided', 'Kosher salt', 'Freshly ground black pepper', '1/4 cup Sherry vinegar or red wine vinegar', '1 tablespoon whole grain mustard', '1 jalapeño, thinly sliced into rounds, seeds removed if desired', '1/4 cup (lightly packed) torn flat-leaf parsley leaves']",
        "instructions": "Preheat oven to 450°. Toss potatoes with 1/4 cup oil on a rimmed baking sheet; season with salt and pepper. Roast, tossing once, until golden brown and tender, 30-35 minutes. Let cool slightly, then lightly flatten.\\r Meanwhile, whisk vinegar and mustard in a large bowl. Gradually whisk in remaining 1/4 cup oil until emulsified; season with salt and pepper. Add potatoes, jalapeño, and parsley and toss; season with salt and pepper.",
        "image_name": "smashed-fingerlings-with-jalapenos-51239670"
    },
    "Black Bean and Rice Salad": {
        "title": "Black Bean and Rice Salad",
        "ingredients": "['1 cup long grain brown rice', '1/4 cup extra-virgin olive oil', '1 Cubanelle chile or Italian frying pepper, trimmed and cut in 1/3-inch dice', '1 medium red onion, finely chopped', '3 garlic cloves, smashed, peeled and minced', '2 cups freshly cut white corn kernels (from 2 ears) or 1 box (10 ounces) frozen corn, thawed', '1 teaspoon kosher salt', '1 15-ounce can black beans, rinsed well and drained', '1 tablespoon distilled white vinegar', 'Freshly ground black pepper']",
        "instructions": "Bring a medium saucepan of salted water to a boil. Add the rice and cook, stirring occasionally, just until tender, about 25 minutes. Drain and rinse well with cold water until cool. Transfer to a large bowl.\\r Heat 2 tablespoons of the oil in the same saucepan over medium heat until hot. Add the chile, onion and garlic and stir until slightly softened, about 3 minutes. Add the corn and salt and cook, stirring, just until heated through, about 1 minute. Transfer the vegetables to the bowl with the rice and toss to mix.\\r Add the beans, the remaining 2 tablespoons oil and the vinegar and toss well. Season with plenty of pepper and toss again.",
        "image_name": "black-bean-and-rice-salad-243130"
    },
    "Raw Caramel Peanut Crunch Bars": {
        "title": "Raw Caramel Peanut Crunch Bars",
        "ingredients": "['20 soft fresh dates (400g), pitted', '1/3 cup (95g) smooth natural peanut butter', '2 teaspoons vanilla extract', '1 cup (30g) puffed brown rice', '1/2 cup (70g) unsalted peanuts, roughly chopped', '80g raw organic 70% dark chocolate']",
        "instructions": "Line a 10cm x 20cm loaf tin with non-stick baking paper.\\r Place the dates, peanut butter and vanilla in a food processor and process for 2–4 minutes or until the mixture comes together into a paste. Transfer to a large bowl, add the puffed rice and peanuts and mix to combine. Using the back of a spoon, press the mixture into the base of the tin (see note).\\r Place the chocolate in a heatproof bowl over a saucepan of simmering water (the bowl shouldn’t touch the water) and stir until melted. Pour the chocolate over the slice and spread evenly. Refrigerate for 20–30 minutes or until set. Remove the slice from the tin and cut into bars using a hot knife. Refrigerate until ready to serve.\\r Keep bars refrigerated in an airtight container for up to 2 weeks.",
        "image_name": "raw-caramel-peanut-crunch-bars"
    },
    "Iced Blueberries in Sweet Cream": {
        "title": "Iced Blueberries in Sweet Cream",
        "ingredients": "['1 pint fresh blueberries', '2 egg whites, slightly beaten', '1 cup plus 2 teaspoons milk or cream', '2 tablespoons honey', 'Pinch of salt', '2 teaspoons sugar']",
        "instructions": "We prefer to start with fresh blueberries rather than frozen ones, because many frozen berries are often processed improperly. To get started, sort your blueberries, setting aside any overripe ones for immediate snacking. The key is to freeze the berries flat, using a plate or baking sheet in the freezer. After the berries are frozen, they can be transferred to a bag and stored for up to six months.\\r While the berries are freezing, combine the egg whites and 1 cup of the milk in a pan on the stovetop, and bring to just under a boil, whisking all the while. Let it simmer for around 5 minutes, then add the honey and salt. After simmering for another minute or two, strain the mixture into a bowl. Add the remaining milk and sugar. Pour the sauce into a pitcher or serving dish and chill; it will thicken as it chills.\\r Pour the cooled sweet cream over the frozen berries to serve.",
        "image_name": "iced-blueberries-in-sweet-cream-51102420"
    }
}